upstream/OpenFOAM-v2606/tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/successor/setups.orig/common/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                       steadyState;
}

gradSchemes
{
    default                       Gauss linear;
    grad(U)                       cellMDLimited Gauss linear 1;
}

divSchemes
{
    default                       none;
    div(phi,U)                    bounded Gauss upwind;

    turbulence                    bounded Gauss upwind;
    div(phi,k)                    $turbulence;
    div(phi,epsilon)              $turbulence;
    div(phi,omega)                $turbulence;

    div(phi,T)                    bounded Gauss upwind;
    div((nuEff*dev(T(grad(U)))))  Gauss linear;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
}

wallDist
{
    method          directionalMeshWave;
    normal          (0 0 1);
}


// ************************************************************************* //
