upstream/OpenFOAM-v2606/tutorials/verificationAndValidation/atmosphericModels/atmFlatTerrain/successor/setups.orig/common/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

__settings0
{
    type    faceSet;
    action  new;
    source  faceToFace;
    set     sideFaces;
}

__settings
{
    type    faceSet;
    action  subset;
    source  boxToFace;
}

actions
(
    {
        name    sideFaces;
        type    faceSet;
        action  new;
        source  patchToFace;
        patch   sides;
    }

    {
        name    p1; ${__settings0};
    }
    {
        name    p10; ${__settings0};
    }
    {
        name    p11; ${__settings0};
    }
    {
        name    p12; ${__settings0};
    }
    {
        name    p13; ${__settings0};
    }
    {
        name    p14; ${__settings0};
    }
    {
        name    p15; ${__settings0};
    }
    {
        name    p16; ${__settings0};
    }
    {
        name    p17; ${__settings0};
    }
    {
        name    p18; ${__settings0};
    }
    {
        name    p19; ${__settings0};
    }
    {
        name    p2; ${__settings0};
    }
    {
        name    p20; ${__settings0};
    }
    {
        name    p21; ${__settings0};
    }
    {
        name    p22; ${__settings0};
    }
    {
        name    p23; ${__settings0};
    }
    {
        name    p24; ${__settings0};
    }
    {
        name    p25; ${__settings0};
    }
    {
        name    p26; ${__settings0};
    }
    {
        name    p27; ${__settings0};
    }
    {
        name    p28; ${__settings0};
    }
    {
        name    p29; ${__settings0};
    }
    {
        name    p3; ${__settings0};
    }
    {
        name    p30; ${__settings0};
    }
    {
        name    p31; ${__settings0};
    }
    {
        name    p32; ${__settings0};
    }
    {
        name    p33; ${__settings0};
    }
    {
        name    p34; ${__settings0};
    }
    {
        name    p35; ${__settings0};
    }
    {
        name    p36; ${__settings0};
    }
    {
        name    p4; ${__settings0};
    }
    {
        name    p5; ${__settings0};
    }
    {
        name    p6; ${__settings0};
    }
    {
        name    p7; ${__settings0};
    }
    {
        name    p8; ${__settings0};
    }
    {
        name    p9; ${__settings0};
    }

    {
        name    p1;
        ${__settings};
        box     (9659.25826289 871.557427477 20) (9961.94698092 2588.19045103 6020);
    }
    {
        name    p10;
        ${__settings};
        box     (-2588.19045103 9659.25826289 20) (-871.557427477 9961.94698092 6020);
    }
    {
        name    p11;
        ${__settings};
        box    (-4226.18261741 9063.07787037 20) (-2588.19045103 9659.25826289 6020);
    }
    {
        name    p12;
        ${__settings};
        box    (-5735.76436351 8191.52044289 20) (-4226.18261741 9063.07787037 6020);
    }
    {
        name    p13;
        ${__settings};
        box    (-7071.06781187 7071.06781187 20) (-5735.76436351 8191.52044289 6020);
    }
    {
        name    p14;
        ${__settings};
        box    (-8191.52044289 5735.76436351 20) (-7071.06781187 7071.06781187 6020);
    }
    {
        name    p15;
        ${__settings};
        box    (-9063.07787037 4226.18261741 20) (-8191.52044289 5735.76436351 6020);
    }
    {
        name    p16;
        ${__settings};
        box    (-9659.25826289 2588.19045103 20) (-9063.07787037 4226.18261741 6020);
    }
    {
        name    p17;
        ${__settings};
        box    (-9961.94698092 871.557427477 20) (-9659.25826289 2588.19045103 6020);
    }
    {
        name    p18;
        ${__settings};
        box    (-10000 -871.557427477 20) (-9000 871.557427477 6020);
    }
    {
        name    p19;
        ${__settings};
        box    (-9961.94698092 -2588.19045103 20) (-9659.25826289 -871.557427477 6020);
    }
    {
        name    p2;
        ${__settings};
        box    (9063.07787037 2588.19045103 20) (9659.25826289 4226.18261741 6020);
    }
    {
        name    p20;
        ${__settings};
        box    (-9659.25826289 -4226.18261741 20) (-9063.07787037 -2588.19045103 6020);
    }
    {
        name    p21;
        ${__settings};
        box    (-9063.07787037 -5735.76436351 20) (-8191.52044289 -4226.18261741 6020);
    }
    {
        name    p22;
        ${__settings};
        box    (-8191.52044289 -7071.06781187 20) (-7071.06781187 -5735.76436351 6020);
    }
    {
        name    p23;
        ${__settings};
        box    (-7071.06781187 -8191.52044289 20) (-5735.76436351 -7071.06781187 6020);
    }
    {
        name    p24;
        ${__settings};
        box    (-5735.76436351 -9063.07787037 20) (-4226.18261741 -8191.52044289 6020);
    }
    {
        name    p25;
        ${__settings};
        box    (-4226.18261741 -9659.25826289 20) (-2588.19045103 -9063.07787037 6020);
    }
    {
        name    p26;
        ${__settings};
        box    (-2588.19045103 -9961.94698092 20) (-871.557427477 -9659.25826289 6020);
    }
    {
        name    p27;
        ${__settings};
        box    (-871.557427477 -10000 20) (871.557427477 -9000 6020);
    }
    {
        name    p28;
        ${__settings};
        box    (871.557427477 -9961.94698092 20) (2588.19045103 -9659.25826289 6020);
    }
    {
        name    p29;
        ${__settings};
        box    (2588.19045103 -9659.25826289 20) (4226.18261741 -9063.07787037 6020);
    }
    {
        name    p3;
        ${__settings};
        box    (8191.52044289 4226.18261741 20) (9063.07787037 5735.76436351 6020);
    }
    {
        name    p30;
        ${__settings};
        box    (4226.18261741 -9063.07787037 20) (5735.76436351 -8191.52044289 6020);
    }
    {
        name    p31;
        ${__settings};
        box     (5735.76436351 -8191.52044289 20) (7071.06781187 -7071.06781187 6020);
    }
    {
        name    p32;
        ${__settings};
        box    (7071.06781187 -7071.06781187 20) (8191.52044289 -5735.76436351 6020);
    }
    {
        name    p33;
        ${__settings};
        box    (8191.52044289 -5735.76436351 20) (9063.07787037 -4226.18261741 6020);
    }
    {
        name    p34;
        ${__settings};
        box    (9063.07787037 -4226.18261741 20) (9659.25826289 -2588.19045103 6020);
    }
    {
        name    p35;
        ${__settings};
        box    (9659.25826289 -2588.19045103 20) (9961.94698092 -871.557427477 6020);
    }
    {
        name    p36;
        ${__settings};
        box    (9000 -871.557427477 20) (10000 871.557427477 6020);
    }
    {
        name    p4;
        ${__settings};
        box     (7071.06781187 5735.76436351 20) (8191.52044289 7071.06781187 6020);
    }
    {
        name    p5;
        ${__settings};
        box     (5735.76436351 7071.06781187 20) (7071.06781187 8191.52044289 6020);
    }
    {
        name    p6;
        ${__settings};
        box     (4226.18261741 8191.52044289 20) (5735.76436351 9063.07787037 6020);
    }
    {
        name    p7;
        ${__settings};
        box     (2588.19045103 9063.07787037 20) (4226.18261741 9659.25826289 6020);
    }
    {
        name    p8;
        ${__settings};
        box     (871.557427477 9659.25826289 20) (2588.19045103 9961.94698092 6020);
    }
    {
        name    p9;
        ${__settings};
        box     (-871.557427477 9000 20) (871.557427477 10000 6020);
    }
);


// ************************************************************************* //
